{"pageProps":{"post":{"id":"cl5iw2y4c24e40blww87ws5jd","title":"O que é HTML?","slug":"o-que-e-html","datePublished":"2022-07-19","author":{"id":"cl5jp70g03nu10blznml3jf8z","name":"Judson Kerller","avatar":{"url":"https://media.graphassets.com/WC2vKk2sQH2IE5bGlM6y"}},"content":{"html":"<p>HTML é a linguagem base dos websites. Ela serve para nós estruturarmos textos, criar links, exibir imagens, vídeo, etc.O seu significado é HyperText Markup Language, traduzindo para português, Linguagem de Marcação de Hipertexto.</p><ul><li><div><strong>HyperText: </strong>significa hypertexto, um texto que contém, refere-se aos links que conectam páginas da Web entre si.</div></li></ul><ul><li><div><strong>Markup: </strong>significa a marcação desse texto. Geralmente fazemos isso com o uso de uma tag, ou elemento HTML. (entederemos isso em breve)</div></li></ul><p>Vale ressaltar que HTML não é uma linguagem de programação, já qque seu objetivo não é criar um software, e sim, marcar a estrutura de linguagens de programação, como por exemplo o JavaScript. Em resumo, o HTML indicará onde os elementos aparecerão na aplicação.</p><p>Existem inúmeras tags e cada uma delas irá servir para um determinado propósito. Exemplo: Imagem, texto grande, links, parágrafo, título,etc. Para cada uma dessas palavras que trouxe, existe uma tag se eu quiser inserir algo do tipo no meu website.</p><p></p><h3>Sintaxe de uma tag</h3><p>Usamos o sinal de maior que e menor que para abrir e fechar uma tag. Dentro dos sinais vai o nome da tag. Para fecharmos uma tag, colocamos uma barra para indicar que ali é o fechamento dela. Como vemos abaixo:</p><img src=\"https://media.graphassets.com/r8Yjv3MSJmqHwPhcUHmh\" alt=\"code.png\" title=\"code.png\" width=\"676\" height=\"336\" /><p>As tags também possuem atributos que adicionam informações e configurações a uma tag. Por exemplo o elemento &quot;a&quot; (ou âncora), ela possui um atributo chamado href, onde cria-se uma hiperligação nas páginas web, arquivos.</p><img src=\"https://media.graphassets.com/1hbMMgZLSvqVAP0V29u2\" alt=\"code.png\" title=\"code.png\" width=\"884\" height=\"556\" /><p>Falamos de tags, elementos, agora vamos falar de...</p><h3>Atributos</h3><p>Os atributos representam caracteristícas e funcionalidades de cada elemento HTML. Temos os atributos globais, como id ou style, e também temos os específicos como o alt que só encontramos no elemento img.</p><img src=\"https://media.graphassets.com/2qJlJzQYRcmiZ5XN8Bvy\" alt=\"code.png\" title=\"code.png\" width=\"884\" height=\"556\" /><p>Por hoje é só. Se gostou, peço que compartilhe esse link, e se realmente aprendeu algo, pode me pagar um café através do link que está no rodapé, clicando em <a target='_blank' title=\"https://www.buymeacoffee.com/judin\" href=\"https://www.buymeacoffee.com/judin\"><strong>CONTRIBUA</strong></a>.</p><p>Forte abraço e até logo!</p>"},"coverPhoto":{"id":"cl5llz0dx837v0blwuye72lfu","url":"https://media.graphassets.com/SZC83H0zTGaRKZcjTutR"}}},"__N_SSG":true}